Revit 2024 API
DefaultDivideSettings.GetDefaultDivideSettings Method
 Obtains the DefaultDivideSettings object for the specified document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static DefaultDivideSettings GetDefaultDivideSettings(
	Document cda
)
Visual Basic
Public Shared Function GetDefaultDivideSettings ( _
	cda As Document _
) As DefaultDivideSettings
Visual C++
public:
static DefaultDivideSettings^ GetDefaultDivideSettings(
	Document^ cda
)
Parameters
cda
Type: Autodesk.Revit.DB.Document
 A document.
Return Value
 The DefaultDivideSettings object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace